soap12.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <GenerarCodigoDeBarrasDePago xmlns="http://tempuri.org/">
      <Nombre>Carlos Armando</Nombre>
      <Apellido>Mulet</Apellido>
      <ImpuestoAbonar>100000</ImpuestoAbonar>
      <TipoDocumento>6</TipoDocumento>
      <NroDocumento>33688645</NroDocumento>
      <Caratula>Mulet Carlos Armando</Caratula>
      <BaseImponible>500.3</BaseImponible>
      <idOrganismo>3</idOrganismo>
      <LetraReceptoria>ZC</LetraReceptoria>
      <NumeroReceptoria>3420</NumeroReceptoria>
      <SufijoReceptoria>2018</SufijoReceptoria>
      <DetalleError>?</DetalleError>
    </GenerarCodigoDeBarrasDePago>
  </soap12:Body>
</soap12:Envelope>